{
    "contents": "<p><b>Job Overview:</b><br><br> We are seeking Senior Principal Biostatisticians to consult on innovative and adaptive clinical trial designs, provide support for DMC/DSMB data review meetings, and analyze all parts of any clinical study. The selected candidate will provide statistical input into other disciplines' activities and participate in interdepartmental processes; provide technical solutions and advice to staff and clients on statistical processes; train less experienced biostatisticians within project activities; and be responsible for the development of Statistical Sections of Protocol including statistical methodology, statistical programming procedures, definition of derived variables, and data handling rules and data display templates.<br><br>Additional responsibilities include:<ul><li> Lead complex studies such as NDA submission or complex, multi-protocol programs, potentially coordinating activities across multiple locations, providing statistical oversight and attending relevant project meetings </li><li> Serve as DMC Support Statistician, developing DMC Charters and attending DMC Meetings </li><li> Lead in the design and consultation on complex studies, and , multi-protocol programs. . Providing statistical oversight and attending relevant project meetings </li><li> Lead the development of complex Statistical Analysis Plans, perform senior review of statistical analysis plans developed by other statisticians </li><li> Perform project management activities for identified projects including resource planning, timelines, and milestone management </li><li> Perform complex statistical analyses, quality check statistical analyses developed by other statisticians </li><li> Conduct overall statistical review of TFLs for complex studies prior to client delivery </li><li> Review CRF and other study specific specifications and plans </li><li> Perform complex sample size calculations </li><li> Develop the statistical sections of the protocol for complex studies under the supervision of an Associate Director Statistician or above </li><li> Provide statistical input and review of the CSR for complex studies </li><li> Preparation and review of randomization specifications and generation of randomization schedules </li><li> Provide mentoring and training to less experienced staff; provide direction and review work of departmental employees to ensure accuracy and adherence to pertinent departmental policies, practices, and procedures </li><li> Present and share knowledge at monthly seminars and /or team meetings and at external scientific meetings and conferences </li><li> Attend bid defense meetings for complex studies such as NDA submissions or complex, multi-protocol programs in order to win new business </li><li> Act as Subject Matter Expert and develop or review procedural documents, or work on new initiatives </li><li> Represent the department during audits  </li></ul><b>Education/Qualifications:</b><br><br> Education:<ul><li> Master's degree, equivalent, or higher in Biostatistics or related field </li></ul><b>Experience:</b><br><br> Experience Required:<ul><li> 10+ years of experience or an equivalent combination of education or experience to successfully perform the key responsibilities of the job </li><li> Ability to program in one or more statistical software packages (SAS®) used to conduct statistical analyses. SAS proficiency including use of a variety of statistical procedures e.g., non-parametric analysis, linear and non-linear models, categorical data and survival analysis </li><li> Ability to perform sample size determination using appropriate statistical software such as NCSS PASS, Cytel EAST, StatSols nQuery, or SAS. </li><li> Proven ability to effectively communicate statistical concepts </li><li> Interpersonal and effective communication skills; able to communicate appropriately throughout Covance and with its clients. </li><li> Excellent problem-solving skills, and a willingness to take ownership of decision-making. </li><li> A good knowledge of the overall clinical trial process and of its application within Covance Clinical Development </li><li> Competence in the preparation of Statistical Analysis Plans, analysis, reporting, etc. across a variety of trials </li><li> Specific up-to-date knowledge of statistics as applied in clinical trials for at least one therapeutic area . </li></ul></p>",
    "name": "Senior Principal Biostatistician (Remote)",
    "type": "external",
    "publication_date": "2021-07-13T12:48:45Z",
    "short_name": "senior-principal-biostatistician-remote-d596e8",
    "model_type": "jobs",
    "id": 6287569,
    "locations": [
        {
            "name": "Montreal, Canada"
        }
    ],
    "categories": [],
    "levels": [
        {
            "name": "Senior Level",
            "short_name": "senior"
        }
    ],
    "tags": [],
    "refs": {
        "landing_page": "https://www.themuse.com/jobs/labcorp/senior-principal-biostatistician-remote-d596e8"
    },
    "company": {
        "id": 11971,
        "short_name": "labcorp",
        "name": "Labcorp"
    }
}