{
    "page": 1,
    "page_count": 23398,
    "items_per_page": 20,
    "took": 13,
    "timed_out": false,
    "total": 467960,
    "results": [
        {
            "contents": "<p><b>Job Overview:</b><br><br> We are seeking Senior Principal Biostatisticians to consult on innovative and adaptive clinical trial designs, provide support for DMC/DSMB data review meetings, and analyze all parts of any clinical study. The selected candidate will provide statistical input into other disciplines' activities and participate in interdepartmental processes; provide technical solutions and advice to staff and clients on statistical processes; train less experienced biostatisticians within project activities; and be responsible for the development of Statistical Sections of Protocol including statistical methodology, statistical programming procedures, definition of derived variables, and data handling rules and data display templates.<br><br>Additional responsibilities include:<ul><li> Lead complex studies such as NDA submission or complex, multi-protocol programs, potentially coordinating activities across multiple locations, providing statistical oversight and attending relevant project meetings </li><li> Serve as DMC Support Statistician, developing DMC Charters and attending DMC Meetings </li><li> Lead in the design and consultation on complex studies, and , multi-protocol programs. . Providing statistical oversight and attending relevant project meetings </li><li> Lead the development of complex Statistical Analysis Plans, perform senior review of statistical analysis plans developed by other statisticians </li><li> Perform project management activities for identified projects including resource planning, timelines, and milestone management </li><li> Perform complex statistical analyses, quality check statistical analyses developed by other statisticians </li><li> Conduct overall statistical review of TFLs for complex studies prior to client delivery </li><li> Review CRF and other study specific specifications and plans </li><li> Perform complex sample size calculations </li><li> Develop the statistical sections of the protocol for complex studies under the supervision of an Associate Director Statistician or above </li><li> Provide statistical input and review of the CSR for complex studies </li><li> Preparation and review of randomization specifications and generation of randomization schedules </li><li> Provide mentoring and training to less experienced staff; provide direction and review work of departmental employees to ensure accuracy and adherence to pertinent departmental policies, practices, and procedures </li><li> Present and share knowledge at monthly seminars and /or team meetings and at external scientific meetings and conferences </li><li> Attend bid defense meetings for complex studies such as NDA submissions or complex, multi-protocol programs in order to win new business </li><li> Act as Subject Matter Expert and develop or review procedural documents, or work on new initiatives </li><li> Represent the department during audits  </li></ul><b>Education/Qualifications:</b><br><br> Education:<ul><li> Master's degree, equivalent, or higher in Biostatistics or related field </li></ul><b>Experience:</b><br><br> Experience Required:<ul><li> 10+ years of experience or an equivalent combination of education or experience to successfully perform the key responsibilities of the job </li><li> Ability to program in one or more statistical software packages (SAS®) used to conduct statistical analyses. SAS proficiency including use of a variety of statistical procedures e.g., non-parametric analysis, linear and non-linear models, categorical data and survival analysis </li><li> Ability to perform sample size determination using appropriate statistical software such as NCSS PASS, Cytel EAST, StatSols nQuery, or SAS. </li><li> Proven ability to effectively communicate statistical concepts </li><li> Interpersonal and effective communication skills; able to communicate appropriately throughout Covance and with its clients. </li><li> Excellent problem-solving skills, and a willingness to take ownership of decision-making. </li><li> A good knowledge of the overall clinical trial process and of its application within Covance Clinical Development </li><li> Competence in the preparation of Statistical Analysis Plans, analysis, reporting, etc. across a variety of trials </li><li> Specific up-to-date knowledge of statistics as applied in clinical trials for at least one therapeutic area . </li></ul></p>",
            "name": "Senior Principal Biostatistician (Remote)",
            "type": "external",
            "publication_date": "2021-07-13T12:48:45Z",
            "short_name": "senior-principal-biostatistician-remote-d596e8",
            "model_type": "jobs",
            "id": 6287569,
            "locations": [
                {
                    "name": "Montreal, Canada"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/labcorp/senior-principal-biostatistician-remote-d596e8"
            },
            "company": {
                "id": 11971,
                "short_name": "labcorp",
                "name": "Labcorp"
            }
        },
        {
            "contents": "<p><strong>Job Description</strong><br>Intel Wireless Communication Solutions WCS is a world class leader in wireless connectivity and the industrys 1 provider of PC WiFi BT solutions.<br>WCS design the next generation of WiFi and BT technology, delivering ultra fast, low latency, low power and ultra reliable wireless connectivity for 100s of million people worldwide, enhancing experiences that range from businesses, education and health to gaming and industrial services.<br><br>WCS CIV Connectivity Integration and Validation org. is responsible for the quality and timely system validation of WCS products using, state of the art, cutting edge validation tools, flows and methodologies including use of ML AI, Crowdsourcing, CI CD, etc.<br><br>We are looking for a top notch System validation engineer for the Connectivity validation team.<br><br>In this role you will be part of WCS CIV, a leading team which responsible for the E2E system validation, integration, regression and debug. You will gain knowledge in, and contribute to, the most advanced wireless technologies.<br><br>The role requires a broad understating of multiple systems, interacting and collaborating with System, Design, Software and additional Validation teams.<br><br> #WCSHIRING <br><br><strong>Qualifications</strong><br><br>BSc in Computer Science, Computer Engineering, EE or similar<br><br>6+ years of experience in validation of SW HW products<br><br>Knowledge in communication and wireless protocols - an advantage<br><br>Low level debug capabilities<br><br>Strong analysis skills<br><br>Very good problem-solving skills<br><br>Automation experience C-Sharp, Python , or similar .Net - Python is an advantage<br><br>Great interpersonal, communication and learning skills<br><br>Highly motivated, self-learning ability and strong technical skills<br><br>Leadership abilities<br><br>Experience with various OSs - an advantage<br><br><strong>Inside this Business Group</strong><br>The Client Computing Group (CCG) is responsible for driving business strategy and product development for Intel's PC products and platforms, spanning form factors such as notebooks, desktops, 2 in 1s, all in ones. Working with our partners across the industry, we intend to continue to advance PC experiences to deliver the real-world performance people demand. As the largest business unit at Intel, CCG is investing more heavily in the PC, ramping its capabilities even more aggressively, and designing the PC experience even more deliberately, including delivering a predictable cadence of leadership products. As a result, we are able to fuel innovation across Intel, providing an important source of IP and scale, as well as help the company deliver on its purpose of enriching the lives of every person on earth.<br><br>IL Experienced Hire JR0186036 Petach-Tiqwa Client Computing Group</p>",
            "name": "Software validation engineer",
            "type": "external",
            "publication_date": "2021-10-09T23:13:06Z",
            "short_name": "software-validation-engineer-3cfa33",
            "model_type": "jobs",
            "id": 7044770,
            "locations": [
                {
                    "name": "Ramat Gan, Israel"
                }
            ],
            "categories": [
                {
                    "name": "Software Engineer"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/intel/software-validation-engineer-3cfa33"
            },
            "company": {
                "id": 53,
                "short_name": "intel",
                "name": "Intel"
            }
        },
        {
            "contents": "<p>At Kohl's Stores, you'll belong to a team that accepts everyone, works hard to help each other succeed, and takes the time to celebrate their wins. Why Kohl's? -Teamwork Culture: Enjoy a culture where we're all in it together. -Shift Flexibility: Enjoy flexible shifts that fit your busy schedule with availability to work days, nights, and weekends required. We'll work with you! -Associate Discount: Earn a 15% associate discount plus stackable coupons for all your holiday gift shopping! -Leaders Who Care: Be supported by leaders who know you, listen and help you succeed. -Top National Brands: We carry the top brands you know and love.<br><br><b>ACCOUNTABILITIES</b><br><ul><li>\"Smiles and Says Hi!\" Greets all customers and associates, assists in a friendly, courteous manner and adheres to the \"Yes We Can\" policy efficiently resolving customer's questions and requests<br></li><li> Consistently uses the 5 step GREAT program while interacting with customers: Greets and Engages Customer, Requests Credit, Explains Savings, Asks to Complete the Survey and Thanks the Customer <br></li><li>Able to learn and adapt to current technology to assist customer needs<br></li><li>Delivers the highest level of customer service through effective problem solving<br></li><li>Solicits, opens and activates Kohl's Charge applications and loyalty programs<br></li><li>Ensures that all cash handling procedures are done in accordance to policy and procedure<br></li><li> Complete transactions accurately and efficiently while engaging customers <br></li><li> Flexible and willing to cross-train and work in other areas of the store, as needed <br></li></ul><br><b>QUALIFICATIONS</b><br><br>REQUIRED<br><ul><li>Ability to lift 50 pounds on an occasional to frequent basis<br></li><li>Ability to spend up to 100% of work time standing or moving about the departments. Physical activities include bending, stooping, lifting, climbing, carrying, walking and/or reaching on a frequent basis<br></li><li>Adherence to Kohl's policy and procedures<br></li><li>Regular attendance<br></li><li>Effective verbal and written communication skills<br></li><li>Basic math and reading skills, legible handwriting and attention to detail<br></li><li>Ability to work as part of a team and interact effectively with others<br></li></ul><br>PREFERRED<br><ul><li>Prior retail experience<br></li><li> Comfortable with the use of technology consistently while performing the required tasks <br></li></ul></p>",
            "name": "Seasonal Retail Sales Associate",
            "type": "external",
            "publication_date": "2021-08-13T11:24:31Z",
            "short_name": "seasonal-retail-sales-associate-fcba9a",
            "model_type": "jobs",
            "id": 6567750,
            "locations": [
                {
                    "name": "Spring Hill, TN"
                }
            ],
            "categories": [
                {
                    "name": "Retail"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/kohls/seasonal-retail-sales-associate-fcba9a"
            },
            "company": {
                "id": 1216,
                "short_name": "kohls",
                "name": "Kohl's"
            }
        },
        {
            "contents": "<p><b>Job Description</b><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br> <br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management <br> •  Work effectively with store management and store crews<br> •  Supervise the store's crew through assigning, directing and following up of all activities<br> •  Effectively communicate information both to and from store management and crews<br> 2. Customer Service<br> •  Assist customers with their questions, problems and complaints<br> •  Promote CVS customer service culture. (Greet, offer help, and thank) <br> •  Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers<br> •  Maintain customer/patient confidentiality<br><br><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><li>Experience in retail</li><b>Education</b><li>High school diploma or equivalent required</li><b>Business Overview</b><br>At CVS Health, we are joined in a common purpose: helping people on their path to better health. We are working to transform health care through innovations that make quality care more accessible, easier to use, less expensive and patient-focused. Working together and organizing around the individual, we are pioneering a new approach to total health that puts people at the heart.<br><br> We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an equal opportunity and affirmative action employer. We do not discriminate in recruiting, hiring or promotion based on race, ethnicity, sex/gender, sexual orientation, gender identity or expression, age, disability or protected veteran status or on any other basis or characteristic prohibited by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities.</p>",
            "name": "Shift Supervisor Management Trainee",
            "type": "external",
            "publication_date": "2021-10-12T12:02:49Z",
            "short_name": "shift-supervisor-management-trainee-4cce20",
            "model_type": "jobs",
            "id": 4398426,
            "locations": [
                {
                    "name": "Montgomery, AL"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-management-trainee-4cce20"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p><b>DESCRIPTION</b><br><br> AnnapurnaLabs as part of AWS, is looking for talented engineers to help us develop the semiconductor platform which is based on revolutionary architecture.<br>Take part in the development of cutting edge products within disruptive system architecture. You'll have the opportunity to work on the technologies that power the world's largest Cloud provider, within a dynamic, open, and fast-paced environment. Amazon Web Services provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world.<br>We are looking for talented people to join the Pre-silicon Verification team and help us technically lead the challenges of the next decade.<br><br>To learn more about Annapurna Labs, you're welcome to watch the following videos from the recent re:Invent conference:<br>AWS re:Invent 2020 - Infrastructure keynote with Peter DeSantis - https://www.youtube.com/watch?v=AaYNwOh90Pg<br>AWS re:Invent 2020: Deep dive on AWS Graviton2 processor-powered EC2 instances - https://www.youtube.com/watch?v=NLysl0QvqXU<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> •  More than 5 years of experience with RTL verification.<br>•  Knowledge of Hardware verification concepts and tools (UVM , Coverage Driven verification)<br>•  Good understanding and knowledge of object oriented programming concepts<br>•  Verilog/ SystemVerilog/ Specman<br>•  Team player.<br>•  Highly motivated.<br>•  Willing to work in dynamic and demanding environment.<br>•  Fast learner.<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> •  Knowledge in the following programming languages: Perl/Bash/TCl/Python/<br>•  Knowledge in PCIe, Processors, Ethernet, DDR<br><br>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability</p>",
            "name": "Verification Technical Leader",
            "type": "external",
            "publication_date": "2021-05-19T00:29:00Z",
            "short_name": "verification-technical-leader",
            "model_type": "jobs",
            "id": 4150886,
            "locations": [
                {
                    "name": "Haifa, Israel"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/amazon/verification-technical-leader"
            },
            "company": {
                "id": 12090,
                "short_name": "amazon",
                "name": "Amazon"
            }
        },
        {
            "contents": "<p>Do you like helping people? Do you have a strong desire to connect people with each other thru technology and entertainment? You may have what it takes to join our team.<br><br>As a Retail Sales Consultant, you'll be the face of AT&amp;T, providing personalized interactions with our customers. You'll deliver excellent customer service while being courteous and knowledgeable of the full suite of AT&amp;T products and services. Being courteous takes on new meaning in today's environment - it is more than just service with a smile. It is creating a meaningful connection between each customer and our brand. Your ability to provide an effortless experience will be rewarded as you work to meet key objectives and sales goals.<br><br>Every day will provide a new set of opportunities, so you'll need to be flexible and open to change. Depending on your location, you may assist with curbside delivery, online orders or even prospecting efforts to attain new customers. You'll also assist with maintaining store inventory, basic sanitizing procedures and the merchandising of products. While prior retail or customer-facing sales experience is a plus, we'll provide training to bring you up to speed!<br><br>Sharing your knowledge with our growing customer base comes with many rewards. Start with the paycheck - base plus commission. Our current full-time Retail Sales Consultants earn an average of $44,792 in total compensation in the first year when successfully meeting or exceeding sales goals. Our top sellers earn an average of $55,965 per year.<br><br>You'll also gain an amazing benefits package, including:<br>• Virtual or in-person employee orientation &amp; ongoing paid training<br>• Exciting career paths<br>• Supportive team environment<br>• Employer-provided mobile device<br>• Medical/dental coverage<br>• 401(k) plan<br>• Tuition reimbursement<br>• Paid time off<br><br>Not to mention some pretty cool perks, like:<br>• One of our latest devices and a service plan. Using our technology, gain first-hand expertise to share with our customers.<br>• Discounts on accessories and additional AT&amp;T products and services. That means you always have access to the coolest gadgets around.<br>• A spring and fall fund to spend on a wide range of Team Color apparel. You'll receive a welcome kit of fun gear to get you started (including two shirts), as well as any required personal protective equipment (PPE).<br><br>At AT&amp;T, the safety of our employees and customers remains our top priority. We are committed to following all protective and safe-distancing guidelines required by local &amp; state authorities in response to COVID-19.<br><br>AT&amp;T will consider for employment qualified applicants in a manner consistent with the requirements of federal, state and local laws<br><br>Apply now!</p>",
            "name": "Retail Sales Consultant",
            "type": "external",
            "publication_date": "2021-08-29T11:16:56Z",
            "short_name": "retail-sales-consultant-0822c1",
            "model_type": "jobs",
            "id": 6707003,
            "locations": [
                {
                    "name": "Sandy, UT"
                }
            ],
            "categories": [
                {
                    "name": "Retail"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [
                {
                    "name": "Fortune 1000",
                    "short_name": "fortune-1000-companies"
                }
            ],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/att/retail-sales-consultant-0822c1"
            },
            "company": {
                "id": 862,
                "short_name": "att",
                "name": "AT&T"
            }
        },
        {
            "contents": "<p><b>DESCRIPTION</b><br><br> People are more reliant than ever on home internet being fast and stable for both work and play. Our Service, AWS Global Accelerator, is built to help accomplish just that. We are providing AWS builders the ability to accelerate their TCP and UDP based workloads by making the dedicated AWS global network available to all. We do this through our geographically distributed network of locations that are deployed close to end customers. Our customers range from gaming and telco to service providers with large geographically distributed customer bases.<br><br>Our service launched in 2019 and we are looking for engineers to join our team in Portland to continue to make it easier for customers of all types to make use of AWS's global network infrastructure. Our Portland team is responsible for the public facing APIs and the back-end infrastructure used to integrate with other AWS services (so not the low level routing or networking logic). Think document databases, Kotlin, Go, Web Services, Message Buses, Step Functions, etc.<br><br>A successful candidate is going to be comfortable working on a broad range of technologies, write clean code, have experience and comfort both designing and working with distributed systems, and in general just be excited to learn and be challenged.<br><br>If you interested in working on a growing service operating at AWS scale while building foundational technology that has an impact on a wide range of networked solutions, you should consider applying for this job. We have no shortage of additional customer value to be delivered on the horizon. You can read more about our service at https://aws.amazon.com/global-accelerator/.<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> •  2+ years of non-internship professional software development experience<br>•  Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>•  1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> •  Bachelors or Master's degree in technology related field (Computer Science, Computer Engineering, Mathematics)<br>•  Entrepreneurial spirit, with track record for delivering results in fast-moving and demanding environments<br>•  Experience building complex, distributed software systems that have been successfully delivered to customers<br>•  Knowledge of professional software engineering practices &amp; best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations<br>•  Proficient with web services, online technologies, and cloud based development.<br>•  Meets/exceeds Amazon's leadership principles requirements for this role.<br>•  Meets/exceeds Amazon's functional/technical depth and complexity for this role.<br><br>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.</p>",
            "name": "Software Development Engineer",
            "type": "external",
            "publication_date": "2021-10-02T00:05:05Z",
            "short_name": "software-development-engineer-5e5d71",
            "model_type": "jobs",
            "id": 5793059,
            "locations": [
                {
                    "name": "Portland, OR"
                }
            ],
            "categories": [
                {
                    "name": "Software Engineer"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/amazon/software-development-engineer-5e5d71"
            },
            "company": {
                "id": 12090,
                "short_name": "amazon",
                "name": "Amazon"
            }
        },
        {
            "contents": "<p><b>DESCRIPTION</b><br><br> As an Amazon Business Intelligence Engineer you will be working in one of the world's largest and most complex data warehouse environments. You should have deep expertise in the design, creation, management, and business use of extremely large datasets. You should have excellent business and communication skills to be able to work with business owners to develop and define key business questions, and to build data sets that answer those questions. You should be expert at designing, implementing, and operating stable, scalable, low cost solutions to flow data from production systems into the data warehouse and into end-user facing applications. You should be able to work with business customers in understanding the business requirements and implementing reporting solutions.<br>The person will need to effectively communicate across hierarchy and be self-motivated to raise the bar on deriving insights from analytics and identify opportunities to delight the customers. Above all you should be passionate about bringing large datasets together to answer business questions and drive change.<br>This person will own the production and delivery of suite of analytics reports and dashboards used by the organization to make key business decisions. This will involve:<br>1) Delivery of standardized performance metrics for global stakeholders (EU Operations Finance and business services team) providing operational bandwidth to Operations finance teams to focus on business partnering initiatives.<br>2) Partner with existing BI leader in executing defined roadmap of projects.<br>3) Provide ad-hoc support to EU Operations finance and business services for SQL report creation, modification and optimization.<br>4) Debug report issues, unblock workflows and communicate with other teams and stakeholders by providing regular status updates.<br><br>Tools used include:<br>1. SQL (Oracle and Redshift)<br>2. ETL tools (internal)<br>3. Excel<br>4. Tableau<br>5. Report scheduling tools (internal)<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> - 4+ years of experience as an analyst or engineer in the data/BI space<br><br>- Experience with data visualization using Tableau, Quick sight, or similar tools<br><br>- Experience with SQL - Retrieve and analyze data using SQL, Excel, and other data management systems<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> - Bachelor's degree in Computer Science, Computer Information Systems, or related fields<br>- 4 to 5 years of relevant work experience<br>- Expert knowledge of SQL with 2 to 3 years of experience writing SQL queries<br>- Expert knowledge of Microsoft Excel<br>- Ability to work in a fast-paced and rapidly-changing environment with experience managing multiple competing priorities and projects<br>- Excellent written, verbal, listening and communication skills<br>- Experience with reporting tools like Tableau or other BI packages<br>- Team player<br>- FP&amp;A expertise to develop forecasting models, and report variance against goals will be an added advantage</p>",
            "name": "Business Intelligence Engineer",
            "type": "external",
            "publication_date": "2021-10-02T00:03:42Z",
            "short_name": "business-intelligence-engineer-b1abb4",
            "model_type": "jobs",
            "id": 5923837,
            "locations": [
                {
                    "name": "Bangalore, India"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/amazon/business-intelligence-engineer-b1abb4"
            },
            "company": {
                "id": 12090,
                "short_name": "amazon",
                "name": "Amazon"
            }
        },
        {
            "contents": "<p>7951 - CBC-Raleigh - 12800 Tuckahoe Creek Pkwy, Richmond, Virginia, 23238<br><br>CarMax, the way your career should be! <b><b>*This job posting is reserved only for students currently attending or have graduated in the past 1 year from an accredited post-secondary Collision Repair or Automotive Trade School program.</b></b><br><b>Please note that this position is listed in Midlothian, Virginia.  This is not the location you will be applying to work at, but you must apply to it so that I have visibility to your application. <b>You will discuss your preferred location and position with a recruiter.</b></b><br><br><b>When our vehicles shine, you will shine</b><br><br>CarMax customers expect to choose from a range of vehicles that look good and meet CarMax's high standards. Working alongside a team of experienced technicians, you will ensure the paintwork and interiors are finished to CarMax's high standards. From replacing parts and sanding, to cleaning and waxing, we bring out the best in every vehicle. And we'll help bring out the best in you too, with a clean, modern, climate-controlled environment where you can work comfortably all year. You will also enjoy a generous range of company benefits including paid vacation, medical and retirement plans, and car purchase discounts.<br><br><b>About CarMax</b><br><br>CarMax disrupted the auto industry by delivering the honest, transparent and high-integrity experience customers want and deserve. This innovative thinking around the way cars are bought and sold has helped us become the nation's largest retailer of used cars, with over 200 locations nationwide.<br><br>Our amazing team of more than 25,000 associates work together to deliver iconic customer experiences. Along the way, we help every associate grow their career and achieve their best, at work and in their community.  We are recognized for our commitment to training and diversity and are one of the FORTUNE 100 Best Companies to Work For.<br><br>CarMax is an equal opportunity employer, and all qualified candidates will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, protected veteran status, disability status, or any other characteristic protected by law.<br><br>Our Commitment to Diversity and Inclusion: <br><br>CarMax is committed to bringing together people from different backgrounds and perspectives, providing employees with a safe, welcoming, and inclusive work environment.<br><br>Upon an applicant's request, CarMax will consider reasonable accommodation to complete the CarMax Job Application .<br><b><b>What you will do - Essential responsibilities</b></b><ul><li>Complete cosmetic inspections of vehicles, noting what's needed to transform them into cars we can be proud of and our customers will love</li><li>Repair and replace small plastic and other parts to ensure everything about the vehicle is in good working order</li><li>Perform paint retouching, post-paint finishing, waxing and buffing to make cars look as good as new</li><li>Follow and promote CarMax's high standards of safety, cleanliness and organization</li></ul><b>Be part of a team that cares about customers and their cars</b><br><br>Things move fast at CarMax, but our standards of quality remain high. Your job is to make sure that each car you work on meets these standards, with a look and feel as good as the last. Enthusiasm and attention to detail are vital in meeting that mark. Our teams rise to the challenge by respecting and sharing each other's experience and knowledge, working together as a team to deliver great results.<br><br><b>Qualifications and requirements</b><ul><li>Experience in one or more of the following is preferred: washing, waxing, cleaning and buffing, masking, sanding, grinding and applying paint; removing and replacing small parts, carrying out minor repairs</li><li>Manual dexterity and physical stamina, lift heavy objects, and walk and stand for extended periods of time</li><li>Customer focus and attention to detail</li><li>Possession of valid driver's license</li></ul>Upon an applicant's request, CarMax will consider reasonable accommodation to complete the CarMax Job Application.</p>",
            "name": "Detailer/Paint Prep Technician - Trade School",
            "type": "external",
            "publication_date": "2021-09-17T11:18:31Z",
            "short_name": "detailerpaint-prep-technician-trade-school-4b5e05",
            "model_type": "jobs",
            "id": 6781029,
            "locations": [
                {
                    "name": "Richmond, VA"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [
                {
                    "name": "Fortune 1000",
                    "short_name": "fortune-1000-companies"
                }
            ],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/carmax/detailerpaint-prep-technician-trade-school-4b5e05"
            },
            "company": {
                "id": 922,
                "short_name": "carmax",
                "name": "CarMax"
            }
        },
        {
            "contents": "<p>The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at http://careers.aramark.com or connect with us on Facebook, Instagram and Twitter.<br><br><b>Description</b><br><br><strong>Position Summary: </strong>The Lead Barista is responsible for the oversight or delegation of responsibilities within the barista operation such as inventory, customer service, drink preparation, and sanitation procedures. Essential functions and responsibilities of the position may vary by Aramark location based on client requirements and business needs.<br><br><strong>Essential Functions:</strong> <br><ul><li>Schedules and assigns daily work assignments to a team and oversees the completion of tasks</li><li>Trains and guides staff on job duties, proper food safety and sanitation procedures, customer service, etc.</li><li>Prepares and serves hot and cold beverages according to brand specifications and the customers' requests</li><li>Serves prepared food items</li><li>Maintains knowledge of menu items and recipes to effectively service the customer</li><li>Sets up and breaks down workstations, including cleaning and sanitizing</li><li>Maintains appearance of location ensuring product is stocked to appropriate levels and all areas are properly cleaned and sanitized</li><li>Maintains excellent customer service and positive attitude towards guest, customers, clients, co-workers, etc.</li><li>Adheres to Aramark safety policies and procedures including proper food safety and sanitation</li><li>Ensures security of company assets</li><li>Other duties and tasks as assigned by manager</li></ul><br><br><b>Qualifications</b><br><br><ul><li>Previous supervisory experience in a related role preferred</li><li>Previous food service experience required</li><li>Must be able to obtain food safety certification</li><li>Must be able to work independently with limited supervision</li><li>Demonstrates excellent customer service skills</li><li>Requires occasional lifting, carrying, pushing, pulling of up to 25 lbs</li></ul></p>",
            "name": "Lead Barista - 360 Cafe C1 - NV - Vegas Fashion Show",
            "type": "external",
            "publication_date": "2021-09-15T23:25:50Z",
            "short_name": "lead-barista-360-cafe-c1-nv-vegas-fashion-show",
            "model_type": "jobs",
            "id": 6855805,
            "locations": [
                {
                    "name": "Las Vegas, NV"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/aramark/lead-barista-360-cafe-c1-nv-vegas-fashion-show"
            },
            "company": {
                "id": 11972,
                "short_name": "aramark",
                "name": "Aramark"
            }
        },
        {
            "contents": "<p><strong> Position Summary...</strong>We are looking for people who take pride in their work to join our team. You help shape our member's entire shopping experience by giving them a positive first and last impression.<br><br>In the member assist - cart attendant role, you are responsible for ensuring members see a well-kept parking lot which includes helping members with their purchases, and ensure there are carts ready and available. You will also assist our members with their club pick up orders, helping them load their vehicles, and support creating a great member experience. This means you are constantly on your feet and on the go. Rain or shine, sleet or snow, our members count on you.<br><br>You will sweep us off our feet if:<br>• You thrive in fast-paced environments<br>• You're a multi-tasker at heart<br>• You keep member satisfaction as your top priority<br>• You can stand for long periods of time while assisting members quickly and accurately<br>• You're a problem solver who tackles obstacles head-on to ensure each task is completed with excellence<br><br>You will make an impact by:<br>• Maintaining a positive attitude by smiling, greeting and thanking members <br>• Providing exceptional customer service to members across the club as needed, answering any questions they may have<br>• Maintaining a clean, neat, and member-ready area<br><br>The member assistant - cart attendant is a great way to start a fulfilling career at Sam's Club. Apply now!<br><br>The above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full job description can be made available as part of the hiring process.<br><br><strong> What you'll do...</strong><br>Ensures club pick up orders are filled by contacting members to notify when pickup time is delayed; informing members when products are unavailable (for example, out of stock); offering members alternative product options when needed; ensuring products are selected and packaged according to company policies and procedures; ensuring items are dispensed when members arrive for pickup; resolving member issues and concerns; and promoting the company's products and services.<br><br>Maintains safety of facility according to company policies and procedures by conducting safety sweeps; following procedures for handling merchandise; and correcting and reporting unsafe situations to facility management.<br><br>Provides member service by acknowledging the member and identifying member needs; assisting members with purchasing decisions; processing member purchases; assisting with payments according to company policies and procedures for different membership and payment types; utilizing cash registers to assist members with transactions; locating and organizing merchandise; zoning the designated areas; resolving member issues and concerns; promoting the company's products and services; organizing and maintaining availability of carts/flatbeds; assisting members with transporting items; utilizing cart retrieval equipment according to company policies and procedures; and maintaining parking lot cleanliness.<br><br>Complies with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices.<br><br>Completes work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback.<br><br><strong></strong><strong><b> Minimum Qualifications...</b></strong><br> Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. <br><br><strong></strong><strong><b> Preferred Qualifications...</b></strong><br> Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. <br><br>Customer Service, Retail experience including operating cash register, Working with mobile retail applications<br><br><strong></strong><strong><b> Primary Location...</b></strong>15 TEXAS STATION CT, TIMONIUM, MD 21093-8263, United States of America</p>",
            "name": "Member Assist Cart Attendant",
            "type": "external",
            "publication_date": "2021-09-11T23:42:12Z",
            "short_name": "member-assist-cart-attendant-010452",
            "model_type": "jobs",
            "id": 3110736,
            "locations": [
                {
                    "name": "Timonium, MD"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/walmart/member-assist-cart-attendant-010452"
            },
            "company": {
                "id": 12010,
                "short_name": "walmart",
                "name": "Walmart"
            }
        },
        {
            "contents": "<p><b>ABOUT THE ROLE</b><br>We are looking for a Data Mapping Editor for the Polish market specifically with Polish language skills. The role of Data Mapping Editor is a full-time, Monday to Friday position, responsible for the efficient processing and curation of video catalogues (VOD/OVD). It requires diligent workflow management to accurately process, update, and match VOD/OVD catalogues as they update and/or become available by different content providers. Data Mapping Editors are also responsible for maintaining, updating, and improving the Gracenote database that powers the consumer product and ultimately the end-user experience. Data Mapping Editors assist and report  directly to Ingest Metadata Production Team Leaders, who manage all market-specific daily operations.The ideal candidate will be able to accurately process a high volume of entertainment metadata in a timely fashion. They will be able to manipulate this data, to normalize and enhance it for evergreen use in the Gracenote database.<br><br><b>RESPONSIBILITIES</b><br><br>• Acquire, normalize and enhance entertainment metadata (OVD/VOD catalogues) from various content providers.<br>• Processing and manipulation of data required to ingest correctly into in-house soft-ware tools.<br>• High attention to detail required to ensure that high-quality, accurate and timely, evergreen content is created in the Gracenote database.<br>• Investigate, query and confirm questionable programming content when applicable.<br>• Run quality and assurance checks via systematic reports looking at the live database.<br>• Analyze and recommend process improvements.<br>• Contribute to team and department projects as assigned.<br>• Other duties as assigned<br><br><b>QUALIFICATIONS</b><br>• Proficient knowledge of the Polish language <br>• Experience using computer software and databases, very good keyboarding skills.<br>• Data entry experience using content management systems beneficial.<br>• Experience with, or desire to work within a team, excellent communication skills.<br>• Must be able to work accurately under deadline.<br>• Good knowledge of television, movies and VOD programming is a plus, especially in the market language.<br><br><b>ABOUT THE TEAM</b><br>Gracenote, a Nielsen Media company, provides entertainment metadata and technology that powers the  world's top cable and satellite providers, consumer electronics, automakers and music services. Metadata drives all product lines -- all are based on data connectivity! We provide clients with a comprehensive global database of compositions, writers and publishers - linking compositions to recordings at scale using machine learning. Providing publishers, societies and entertainment services with essential reference data for rights management.<br><br><b>ABOUT NIELSEN</b><br><br>As the arbiter of truth, Nielsen Global Media fuels the media industry with unbiased, reliable data about what people watch and listen to. To discover what's true, we measure across all channels and platforms- from podcasts to streaming TV to social media. And when companies and advertisers are armed with the truth, they have a deeper understanding of their audiences and can accelerate growth.<br><br>Do you want to move the industry forward with Nielsen? Our people are the driving force. Your thoughts, ideas and expertise can propel us forward. Whether you have fresh thinking around maximizing a new technology or you see a gap in the market, we are here to listen and take action. Our team is made strong by a diversity of thoughts, experiences, skills, and backgrounds. You'll enjoy working with smart,fun, curious colleagues, who are passionate about their work. Come be part of a team that motivates you to do your best work!<br><br>Gracenote, a Nielsen company, provides music, video, and sports content along with technologies to the world's hottest entertainment products and brands. Gracenote is the global standard for music and video recognition which is supported by the largest source of entertainment data. Gracenote features descriptions of more than 200 million tracks, TV listings for 85+ countries and statistics from 4,500 sport leagues and competitions.<br><br>#LI-RS1</p>",
            "name": "Data Mapping Editor, Polish",
            "type": "external",
            "publication_date": "2021-09-23T12:01:58Z",
            "short_name": "data-mapping-editor-polish",
            "model_type": "jobs",
            "id": 6929899,
            "locations": [
                {
                    "name": "Amsterdam, Netherlands"
                }
            ],
            "categories": [
                {
                    "name": "Editor"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/nielsen/data-mapping-editor-polish"
            },
            "company": {
                "id": 12065,
                "short_name": "nielsen",
                "name": "Nielsen"
            }
        },
        {
            "contents": "<p><b>DESCRIPTION</b><br><br> Work hard. Have fun. Make history.<br>Amazon Japan GK/Careers<br>Sr. Transactions Manager - Global Real Estate &amp; Facilities<br>Job Description<br>As a member of the Global Real Estate &amp; Facilities (GREF) team overseeing corporate office space  this position will participate in and lead all transaction management activity in the Japan's portfolio. The role will be based in Tokyo and include regular travel throughout the Japan's portfolio. This role combines transaction management, project management skills, and team leadership. We seek a senior leader who demonstrates ownership and proven success in a fast-growing real estate organization delivering a large volume of simultaneous complex transactions under demanding timelines. The successful candidate must operate as a true partner to local business leaders, finance, HR, IT, and other functional areas and establish highly integrated relationships with vendor partners. He/she must be comfortable operating on both the strategic and tactical levels, simultaneously acting as an internal ambassador, educator, analyst, solutions architect, and implementer. The optimal candidate is an experienced, vibrant, and engaging professional who will excel within an entrepreneurial culture  providing vision, leadership, and communication  and not afraid to dive into details. They should also understand the nuances of being an approachable and smart leader  fostering transparent external relationships, and balancing frugality with creativity.<br><br>Responsibilities<br>•  Manage and negotiate a high volume deal flow of large and complex leases and build-to-suit transactions.<br>•  Engage with local brokers for market research, engagement terms, commission tracking and overseeing local transaction execution.<br>•  Working with vendor partners and GREF Finance, generate comparative financial analyses, including lease cash flows, P&amp;L comparisons, building valuations, etc.<br>•  Oversee analysts' qualitative and financial analysis relevant to portfolio.<br>•  Work with internal and external legal counsel, as needed, in preparing all documentation relating to any transaction, including RFP's, Offer Letter's, Letters of Intent, Lease Agreements, Amendments, Agency Agreements, Estoppel Certificates, etc.<br>•  Work closely with strategic planning team to continuously evaluate opportunities to optimally align portfolio.<br>•  Support strategic portfolio planning using complex financial models to guide business decisions and influence multiple business groups.<br>•  Prepare and present six-pagers, proposals, and analysis summaries to senior business and real estate managers for review and approval.<br>•  Develop and maintain strong relationships (Earn Trust) with internal business partners (Country Managers, Senior Leaderships in Japan, Finance, Divisional and Business Unit Heads).<br>•  Effectively communicate expectations, requirements and status of deals to key business partners  both internal and external.<br>•  Draft spend approval documentation and work with finance team to align financial analysis for all OPEX and CAPEX investments prior to lease commitment and manage to deadlines.<br>•  Create, innovate and implement a relevant system of metrics to plan, manage, measure and evaluate performance pertaining to the transaction process.<br>•  Continue to build a culture of speed, flexibility and frugality with all business partners.<br>•  Closely collaborate with Amazon operations, legal, finance, treasury, capacity planning, economic development, transportation and engineering groups to deliver highly successful projects.<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> Basic Qualifications:<br>•  A minimum of 15 years professional experience required - a significant portion of which should demonstrate success in managing a transaction portfolio of similar size and complexity<br>•  Demonstrated experience as a leader with 7+ years of senior management responsibilities<br>•  Bachelors' degree in related field<br>•  Experience building and managing a team or department within a startup or entrepreneurial setting, particularly one with both proprietary and contract resources<br>•  A track record of championing speed, flexibility and frugality in the face of rapid change and extremely heavy workload<br>•  Highly competent with personal computers and productivity software, including Microsoft Outlook, Word, Excel, Project, and SharePoint<br>•  Exceptional communication skills; proven ability to lead cross-functional teams through influence versus direct management; excellent interpersonal skill<br>Strong interpersonal skills<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> Master's degree in a related field (MBA, Masters in Real Estate, etc.)<br>Comfortable with legal terms and structures for standard commercial lease contracts<br>Strong ability to identify and solve ambiguous problems<br>Proven self-starter who sets aggressive goals and consistently gets results<br>Demonstrated ability to think strategically and successfully execute tactics<br>Effective resource management and project management skills</p>",
            "name": "Senior Facilities Manager",
            "type": "external",
            "publication_date": "2021-10-02T00:02:26Z",
            "short_name": "senior-facilities-manager",
            "model_type": "jobs",
            "id": 5941952,
            "locations": [
                {
                    "name": "Tokyo, Japan"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/amazon/senior-facilities-manager"
            },
            "company": {
                "id": 12090,
                "short_name": "amazon",
                "name": "Amazon"
            }
        },
        {
            "contents": "<p><b>ALL ABOUT TARGET</b><br>As part of our collaborative and guest-obsessed team, you help us create an experience that makes guests say, \"I love Target!\"  When you work at Target, you're helping every family discover the joy in everyday life.  You're working alongside a dedicated team that cares, grows, and wins together. A team that is inclusive, makes connections, and that brings their passion and pride to all that they do. The food and beverage team works together to provide the guest a fresh, full, and food safe shopping experience all day, every day.<br><br><b>ALL ABOUT FOOD &amp; BEVERAGE</b><br>The Food &amp; Beverage team enables a consistent experience for our guests by ensuring product is fresh, in stock, available and accurately priced and signed on the sales floor. They are experts of operations, process and efficiency. This team leads food and food services including replenishment, inventory accuracy, food safety, presentation, pricing and promotional signing processes for all Food and Beverage areas of the store.<br><br><b>At Target we believe in our team members having meaningful experiences that help them build and develop skills for a career. These roles can provide you with the:</b><ul><li>Knowledge of guest service fundamentals and experience building a guest first culture in food &amp; beverage</li><li>Ability to provide guests with information around when to purchase items and in what quantity, as well as storage tips</li><li>Experience in Food &amp; Beverage business fundamentals; department sales trends, inventory, quality and freshness management, guest shopping patterns and pricing and promotions strategies</li><li>Knowledge in food seasonality, freshness and quality, food safety standards and routines, and merchandising</li></ul><b>WHAT WE ARE LOOKING FOR</b><br><b>We might be a great match if:</b><ul><li>Working in a fun and energetic environment makes you excited.... We work efficiently and as a team to deliver for our guests</li><li>Providing service to our guests that makes them say I LOVE TARGET! excites you.... That's why we love working at Target</li><li>Stocking, Setting and Selling Target products sounds like your thing... That's the core of what we do.</li><li>You aren't looking for Monday thru Friday job where you are at a computer all day... We are busy all day (especially on the weekends), making it easy for the guest to feel welcomed, inspired and rewarded</li></ul><b>The good news is that we have some amazing training that will help teach you everything you need to know</b><b>.</b> <b>But there are a few skills you should have from the get-go:</b><ul><li>Previous food or grocery experience preferred, but not required</li><li>Welcoming and helpful attitude toward guests and other team members</li><li>Learn and adapt to current technology needs</li><li>Work both independently and with a team</li><li>Resolve guest questions quickly on the spot</li><li>Attention to detail and follow a multi-step processes</li></ul><b>We are an awesome place to work and care about our teams, so we want to make sure we are clear on a few more basics that we expect:</b><ul><li>Accurately handle cash register operations</li><li>Climb up and down ladders</li><li>Scan, handle and move merchandise efficiently and safely, including frequently lifting or moving merchandise up to 40 pounds</li><li>Flexible work schedule (e.g., nights, weekends and holidays) and regular attendance necessary</li></ul><b>Roles Include:</b><ul><li>Food Service Expert</li><li>Starbucks Barista</li><li>Food &amp; Beverage Expert</li><li>Food &amp; Beverage Expert - Adult Bev (Limited Stores Only)</li></ul><b>Americans with Disabilities Act (ADA)</b><br><br>Target will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.</p>",
            "name": "Food & Beverage, Starbucks, Deli, Bakery (T1959)",
            "type": "external",
            "publication_date": "2021-09-24T11:38:14Z",
            "short_name": "food-beverage-starbucks-deli-bakery-t1959-4b159b",
            "model_type": "jobs",
            "id": 6942380,
            "locations": [
                {
                    "name": "Mesa, AZ"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [
                {
                    "name": "Fortune 1000",
                    "short_name": "fortune-1000-companies"
                }
            ],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/target/food-beverage-starbucks-deli-bakery-t1959-4b159b"
            },
            "company": {
                "id": 637,
                "short_name": "target",
                "name": "Target"
            }
        },
        {
            "contents": "<div><div>The Best Buy Advisor engages customers using relationship skills and inspires them to see what's possible with technology. In addition, they build quality relationships with customers and clients, making them feel excited, confident, and appreciated while providing them with relevant and memorable solutions.<br><br>Our Best Buy Advisor maintains knowledge of technology products and services through necessary trainings and certifications as well as self-development. The Advisor learns fundamental sales and customer service skills while having the opportunity to train across the departments they're most excited about.<br><br>Our Advisors support the operational processes of sales, returns and exchanges when working in customer service. They also work closely with other employees to demonstrate, promote, and sell products and services within all store sales zones as needed.<br><br><b>Key Responsibilities</b></div><ul><li><div>Helps drive a positive customer experience by building relationships, exhibiting empathy, and providing solutions to their needs.</div></li><li><div>Engages customers using acquired skills to complete and support the customer experience.</div></li><li><div>Processes transactions such as sales orders, returns and exchanges.</div></li><li><div>Achieves profitable growth to meet team and individual goals while enabling an excellent customer shopping experience.</div></li><li><div>Applies the appropriate knowledge and expertise through ongoing learning and self-development.</div></li><li><div>Utilizes available tools to stay current on promotional initiatives and help execute profitable growth through critical business drive times.</div></li><li><div>Generates future opportunities by discovering the deeper needs of our customers to build lasting relationships.</div></li><li><div>Embraces our learning culture to continuously improve existing skills while acquiring new ones in support of our customer obsession and advancing your contribution.</div></li><li><div>Maintains merchandising and department readiness to serve customers within a specified area.</div></li></ul><div><b>Basic Qualifications</b></div><ul><li><div>Ability to work successfully as part of a team</div></li></ul><div><b>Preferred Qualifications</b></div><ul><li><div>3 months experience working in customer service, sales or related fields</div></li></ul></div>",
            "name": "Customer Experience Specialist (Advisor)",
            "type": "external",
            "publication_date": "2021-10-02T11:01:49Z",
            "short_name": "customer-experience-specialist-advisor-42ae0d",
            "model_type": "jobs",
            "id": 6793459,
            "locations": [],
            "categories": [],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/bestbuy/customer-experience-specialist-advisor-42ae0d"
            },
            "company": {
                "id": 12361,
                "short_name": "bestbuy",
                "name": "Best Buy"
            }
        },
        {
            "contents": "<p><b>Job Description</b><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<br><br>•  Communicate well verbally and in writing to support and lead your team.<br>•  Perform customer care duties to provide high levels of service.<br>•  Execute merchandising strategies to support store sales growth.<br>•  Manage the store inventory and assets to maintain profitability.<br><br>We are invested in your growth and anticipate that you will be as well. We expect our SMIT's to:<br><br>•  Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.<br>•  Support your store as management team member and lead in a manner that is consistent with CVS values and policies.<br>•  Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"<br>•  Be willing to accept promotion roles with the market that you work in.<br><br>Selection for the SMIT position does not guarantee promotion into a Store Manager position. Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<br><br><b>Required Qualifications</b><br>•  Willingness to accept a promotion to Store Manager role at any location in the designated market.<br>•  Ability to transfer to other CVS Pharmacy stores located within the designated market.<br>•  Ability to work a schedule that may vary based on business needs.<br>•  High School diploma or GED<br><br><b>Preferred Qualifications</b><br>•  Bachelor's Degree<br>•  Retail management experience, or experience as a CVS Supervisor<br><br><b>Education</b><br>.<br><br><b>Business Overview</b><br>At CVS Health, we are joined in a common purpose: helping people on their path to better health. We are working to transform health care through innovations that make quality care more accessible, easier to use, less expensive and patient-focused. Working together and organizing around the individual, we are pioneering a new approach to total health that puts people at the heart. <br> <br>We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an equal opportunity and affirmative action employer. We do not discriminate in recruiting, hiring or promotion based on race, ethnicity, sex/gender, sexual orientation, gender identity or expression, age, disability or protected veteran status or on any other basis or characteristic prohibited by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities.</p>",
            "name": "Retail Store Manager",
            "type": "external",
            "publication_date": "2021-10-11T12:10:25Z",
            "short_name": "retail-store-manager-826765",
            "model_type": "jobs",
            "id": 5992219,
            "locations": [
                {
                    "name": "King of Prussia, PA"
                }
            ],
            "categories": [
                {
                    "name": "Retail"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/retail-store-manager-826765"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p><b>Job Description</b><br><br>At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. Weâ€™re committed to fostering an environment for every teammate thatâ€™s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.<br><br>Location:<br> <br>Brisbane<br> <br>Category:<br> <br>Engineering / Technical<br> <br>Position Type:<br> <br>Permanent<br> <br>Job Reference:<br> <br>BOE/1560144B<br> <br>No File Attached<br> <br>Share This:<br><br>Boeing Defence Australia's Systems Engineering, Integration and Test (SEIT) Capability provides skilled people, know-how, process and tools to manage system requirements, design, performance and test for program execution and growth opportunities. As one of the country's leading and preferred defence partners, Boeing Defence Australia (BDA) develops and sustains leading edge technologies for some of Australia's largest and most complex defence projects. Boeing also provides unique opportunities for professional development and career pathways.<br> <br>The SEIT Capability is looking for a highly motivated and experienced <strong>Senior Electromagnetic Effects (EME) Engineer or Scientist</strong> to become part of our multi-disciplinary, multi-site team to contribute to cutting edge systems and exciting new technology development and verification across current and future Boeing platforms. You can be based in Brisbane, Melbourne, Newcastle or Adelaide to conduct this role.<br> <br>As a senior EME Engineer or Scientist at BDA, you will:<br> <ul><li>Contribute to the open, inclusive and innovative team culture that we have</li><li>Contribute to strong development and knowledge sharing frameworks</li><li>Actively participate in the development and expansion of BDA's EME capability</li><li>Oversee and ensure EME related requirements and design are defined, implemented and verified to produce effective and compliant solutions</li><li>Estimate EME associated project tasks</li><li>Negotiate certification plans</li><li>Present compliance findings to relevant authorities</li><li>Provide mentorship to engineers developing their skills and knowledge in this specialist field</li><li>Plan and participate in EMC verification activities</li></ul>To thrive in this environment, you will be…<br> <ul><li>Outcome focused and demonstrates a strong commitment to the Boeing values</li><li>Team orientated, influential and likes a challenge</li><li>Tertiary degree qualified in an engineering or related technical discipline</li><li>Have demonstrated experience in applying relevant engineering practices, standards and regulations</li><li>Experienced with EMC laboratory test procedures and protocols for establishing test configurations, monitoring testing and reporting</li><li>Experienced with composite structures and the design practices required to assure EME protection, including familiarity with composite structure lightning direct effects and protection measures and related regulations, would be considered highly desirable</li><li>Experienced in using CATIA or similar for design reviews would also be desirable</li><li>15+ years experience within related EMC discipline</li></ul>In joining our team at BDA, you can:<br> <ul><li>Work on innovative, complex, technology products which contribute to ensuring a world class Australian defence capability</li><li>Enjoy and contribute to a positive team culture across a diverse, passionate, and inclusive organisation</li><li>Be supported to grow and develop your career</li><li>Work under flexible arrangements to enable work-life balance</li></ul>Applicants must be Australian Citizens to meet defence security requirements.<br> <br>BDA is an Equal Opportunity Employer committed to promoting a diverse and safe workplace, and particularly encourages women and people of Aboriginal or Torres Strait Islander descent to apply.</p>",
            "name": "Electronic & Electrical Engineering Specialist",
            "type": "external",
            "publication_date": "2021-10-02T12:19:03Z",
            "short_name": "electronic-electrical-engineering-specialist-748e54",
            "model_type": "jobs",
            "id": 7020234,
            "locations": [
                {
                    "name": "Brisbane, Australia"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/theboeingcompany/electronic-electrical-engineering-specialist-748e54"
            },
            "company": {
                "id": 12159,
                "short_name": "theboeingcompany",
                "name": "The Boeing Company"
            }
        },
        {
            "contents": "<p>We are seeking a DTC Associate to join our Newark, New Jersey team. Our Managed Services team here at Broadridge supports a multitude of clients. While the team's volume and daily activity is weighted towards the US market, our coverage includes the fast-growing global custody which is supported across the globe. Although there are client specific functions performed by the independent teams, there are similarities when processing across client streams. With the right training and motivation, you will be able to enrich your knowledge because of the broad client base that Broadridge has. Broadridge gives you exposure to many entities rather than working in one shop on one particular function. Because of this, the opportunity to develop your career is greater and can be done in a shorter amount of time.</p>\n<p><strong>Responsibilities</strong>:<br/>\n- Support Depository Trust and Clearing Corporation (DTCC) Settlement functions and related processes such as Buy-Ins, Prime Broker and Vault.<br/>\n- Facilitate development of Broadridge’s Settlement tools such as Global Framework (GFW), Broadridge Exception Event System (BEES) and Universal Dashboard by providing operational expertise and conducting user acceptance tests (UAT).<br/>\n- Participate in onboarding new clients onto Broadridge product suite such as ‘Brokerage Processing Services’ (BPS) for equity trade settlement and ‘Impact’ for Fixed Income trade settlement.<br/>\n- Conduct training programs on Broadridge products such as GFW, BPS, impact, Buy-Ins System and Universal Dashboard that are heavily used within the Settlements department.<br/>\n- Address daily operational critical issues from clients as a result of system or human error and resolve them in a timely manner. Also communicate the issue, solution, and plan of action for future avoidance in a timely manner to both the internal and external parties.<br/>\n- Limit market exposure for clients by supervisi unsettled trades with high Mark to Market (MTM) exposure and by supervising suspense account activities.<br/>\n- Identify and implement Robotic Process Automation (RPA) on processes within the DTC Settlements area to deliver benefit services to the clientele.<br/>\n- Perform quality controls by ensuring Written Supervisory Procedures (WSP) is adhered by the group.<br/>\n- Develop and maintain Standard Operating Procedures (SOP) for training purposes, for reference during critical issues and for detailed operations.<br/>\n- Coordinate and connect with support functions such as HR, IT and Finance for system related, project related and team related functions.</p>\n<p><strong>Qualifications</strong>:<br/>\n- 6+ years of experience with a bachelor's degree/equivalent experience<br/>\n- Series 99 preferred<br/>\n- A self-starter with keen attention to detail<br/>\n- Ability to work under tight deadlines and multi-task<br/>\n- Quick learner that can adapt to a growing business<br/>\n- Ability to maintain a positive relationship with clients and internal associates alike</p>\n<h1>LI-MV1</h1>",
            "name": "Senior Associate Settlements - JR1029255",
            "type": "external",
            "publication_date": "2021-07-07T10:36:02Z",
            "short_name": "senior-associate-settlements-jr1029255",
            "model_type": "jobs",
            "id": 6240196,
            "locations": [
                {
                    "name": "Newark, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Accounting"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/broadridge/senior-associate-settlements-jr1029255"
            },
            "company": {
                "id": 702,
                "short_name": "broadridge",
                "name": "Broadridge"
            }
        },
        {
            "contents": "<p><strong> Position Summary...</strong>Do you have a knack for helping people, following recipes and organization? Our Bakery/Packager associates prepare fresh baked items daily for our members through follow recipes and wrapping, labeling, and storing merchandise to ensure our members have the freshest items available to take home to their families. There are times when you will juggle several tasks in a short amount of time while helping members with their bakery orders. It's hard work, but our bakery team finds it rewarding, especially since they're a part of a large team with a common goal: happy, satisfied members. <br><br>You will sweep us off our feet if:<br>• You thrive in fast-paced environments<br>• You're a multi-tasker at heart<br>• You keep member satisfaction as your top priority<br>• You can stand for long periods of time while assisting members quickly and accurately<br>• You're a problem solver who tackles obstacles head-on to ensure each task is completed with excellence<br>You will make an impact by:<br>• Maintaining a positive attitude by smiling, greeting and thanking members <br>• Providing exceptional customer service to members across the club as needed, answering any questions they may have<br>• Maintaining a clean, neat, and member-ready area<br>The above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full job description can be made available as part of the hiring process.<br><br><strong> What you'll do...</strong><ul><li><b>Be a Team Member:</b> Collaborates with other associates to build a strong bakery team; communicating with the members of the team; and being flexible to the needs of the business to work in other areas.</li><li><b>Be an Expert: </b>Prepares bakery department merchandise based on daily production needs by operating baking equipment; following recipes/make-up instructions; wrapping, labeling, and storing merchandise according to company policies and procedures; ensuring compliance with food safety standards, sanitation guidelines, cold chain compliance, and inventory management; operating, maintaining, and sanitizing equipment; and demonstrating understanding of product and layout execution.</li><li><b>Be a Techie: </b>Leverages digital tools to drive sales, improve the shopping experience, and elevate associate engagement; utilizing hand held technology to make immediate business decisions related to production, merchandise ordering, training, and product quality with the member in mind; adapting to new tools and encouraging others to use them.</li><li><b>Be an Owner:</b> Ensures commitment to operational excellence, maintaining work area according to company policies and procedures; ensuring quality and date control standards for bakery items; securing fragile and high-shrink merchandise; eliminating waste; assisting members with purchasing decisions; and ensuring merchandise is properly packaged, labeled, and stored in accordance with company policies and procedures.</li><li><b>Be a Talent Ambassador:</b> Being an advocate for the department and the club by valuing the member's experience in bakery area and modeling high quality service and products; executing the basics at highest possible level of quality; and exhibiting energy, commitment, and passion for the work.</li><li>Complies with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices.</li><li>Completes work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback.</li></ul><br><br><strong></strong><strong><b> Minimum Qualifications...</b></strong><br> Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. <br><br>I acknowledge that the position for which I am applying requires me to successfully complete all job required trainings and assessments within a prescribed time period if I receive the position.<br>Must be 18 years of age or older<br><br><strong></strong><strong><b> Preferred Qualifications...</b></strong><br> Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. <br><br><strong></strong><strong><b> Primary Location...</b></strong>3660 E SUNSHINE ST, SPRINGFIELD, MO 65809-2820, United States of America</p>",
            "name": "(USA) Baker / Packager - PT Hiring Event",
            "type": "external",
            "publication_date": "2021-10-08T23:30:09Z",
            "short_name": "usa-baker-packager-pt-hiring-event-f860d6",
            "model_type": "jobs",
            "id": 7071245,
            "locations": [
                {
                    "name": "Springfield, MO"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Entry Level",
                    "short_name": "entry"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/walmart/usa-baker-packager-pt-hiring-event-f860d6"
            },
            "company": {
                "id": 12010,
                "short_name": "walmart",
                "name": "Walmart"
            }
        },
        {
            "contents": "<p>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.<br><br><b>Summary</b><br><br>Facebook Reality Labs is making products that enable people to feel connected anytime, anywhere. We can only accomplish this through ingenuity and intelligent technology built into our products. To achieve this, we are looking for a talented Supplier Quality Engineer who can develop new products and technologies for our AR/VR platform.As part of the Facebook Reality Lab quality group, you will collaborate with cross-functional engineering teams to design cutting-edge EE/EM modules, set up a world-class quality system at our supply chain partners, and deliver elite quality products. Come join our vision to build the future of AR/VR.<br><br><b>Required Skills</b><br><br><ul><li>The Supplier Quality Engineer will work closely with the engineering team to understand product design intent and then be a major part of supplier identification and selection</li><li>Develop and institutionalize our vendor and supplier selection process</li><li>Evaluate prospective vendors for process capability based on project needs</li><li>Collaborate with product development, sourcing, TPM, EPM, Operations PM, product cost engineer, manufacturing test engineer, product quality teams to define product manufacturing requirements</li><li>Work with the design team to identify and incorporate manufacturability and assembly optimizations</li><li>Partner with Engineering to define product acceptance plans based on PRD</li><li>Partner with in-region SQEs and MDEs to design, implement, and validate fixtures, equipment, and process controls to ensure stable manufacturing. Define assembly process and line layout for module vendors, providing progressively refined labor cost, and capacity estimates</li><li>Publish concise reports of NPI and NTI activities</li><li>Work with in-region SQEs and MDEs for assessing supplier production and quality control, evaluating supplier readiness and adherence to module quality plan, and supporting general mechanical assembly &amp; manufacturing operations</li><li>Collaborate with Suppliers and Engineering teams in assessing, proposing, and developing process technologies based on project requirements</li><li>Drive Design-for-Manufacturability (DFM) activities with vendors on the tool and process design for complex geometries and provide technical support in enhancing process capability and resolving technical issues</li><li>Establish quality programs and manufacturing process control plans for early detection of issues and to ensure the highest level of quality and reliability is consistently delivered</li><li>Ability and willingness to travel up to 35% to global locations</li></ul><br><br><b>Minimum Qualification</b><br><br><ul><li>BS degree in Electrical/Mechanical/Manufacturing Engineering</li><li>7+ years of experience in supplier quality engineering in consumer electronics</li><li>Familiarity with battery, acoustics, and FPC/FPCA to support these modules</li><li>Experience developing processes quality plans, supplier quality audits, and driving corrective actions/failure analysis efforts</li><li>Experience with quality tools such as SPC, FMEA, GR&amp;R, DoE, metrology, GD&amp;T, and Correlation studies</li><li>Experience with doing data analysis using Excel, Minitab, or JMP</li><li>Experience in developing tooling, jigs, and fixtures</li><li>Experience identifying risk and developing solid plans to mitigate</li><li>Communication, problem-solving, and collaboration skills</li><li>Knowledge of conducting Design/Process FMEA, Failure analysis, PPAP, and Statistical Process Control</li><li>Knowledgeable in conducting DOEs, Line qualification, Machine Buy-off, Cycle Time &amp; UPH studies, and Automation</li></ul><br><br><b>Preferred Qualification</b><br><br><ul><li>Master's degree in Electrical/Mechanical/Manufacturing</li><li>Familiarity with DFMEA and tolerance analysis</li><li>Project management experience and a track record of creative problem-solving in a development environment</li><li>Ownership/Leadership mindset with an experience being in a leadership position and achieve results with minimal supervision</li><li>Acoustics experience</li><li>Process and manufacturing experience with acoustic products such as speakers, speaker box, microphone, etc.</li><li>Acoustic testing knowledge and experience implementing audio test solutions at vendors</li><li>Understanding of Soundcheck, Klippel, and audio precision is important</li><li>Hands-on experience with acoustics electrical performance and reliability testing</li></ul><br><br><b>EOE</b><br><br>Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at <a href=\"mailto:accommodations-ext@fb.com?Subject=Hello\">accommodations-ext@fb.com</a>.</p>",
            "name": "Supplier Quality Engineer",
            "type": "external",
            "publication_date": "2021-08-20T23:10:43Z",
            "short_name": "supplier-quality-engineer",
            "model_type": "jobs",
            "id": 6143608,
            "locations": [
                {
                    "name": "Sunnyvale, CA"
                }
            ],
            "categories": [],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [
                {
                    "name": "Fortune 1000",
                    "short_name": "fortune-1000-companies"
                }
            ],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/facebook/supplier-quality-engineer"
            },
            "company": {
                "id": 659,
                "short_name": "facebook",
                "name": "Facebook"
            }
        }
    ],
    "aggregations": {}
}